#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Tyk/repo-policy-tyk-identity-broker/runs/run-1XRM7zhe4pvcJpNR

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
module.tyk-identity-broker.github_repository.repository: Refreshing state... [id=tyk-identity-broker]
module.tyk-identity-broker.github_branch.default: Refreshing state... [id=tyk-identity-broker:master]
module.tyk-identity-broker.github_branch_protection.automerge["release-1.3"]: Refreshing state... [id=BPR_kwDOAtnrYs4B_GQn]
module.tyk-identity-broker.github_branch.release_branches["release-1.2"]: Refreshing state... [id=tyk-identity-broker:release-1.2]
module.tyk-identity-broker.github_branch_protection.automerge["master"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTUzMTE5Nzc=]
module.tyk-identity-broker.github_branch_protection.automerge["release-1.4"]: Refreshing state... [id=BPR_kwDOAtnrYs4CHTEd]
module.tyk-identity-broker.github_branch.release_branches["release-1.3"]: Refreshing state... [id=tyk-identity-broker:release-1.3]
module.tyk-identity-broker.github_branch.release_branches["release-1.4"]: Refreshing state... [id=tyk-identity-broker:release-1.4]
module.tyk-identity-broker.github_branch_protection.automerge["release-1.2"]: Refreshing state... [id=BPR_kwDOAtnrYs4B_GQp]
module.tyk-identity-broker.github_branch.release_branches["master"]: Refreshing state... [id=tyk-identity-broker:master]
module.tyk-identity-broker.github_branch_default.default: Refreshing state... [id=tyk-identity-broker]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.tyk-identity-broker.github_branch.release_branches["release-1.5"] will be created
  + resource "github_branch" "release_branches" {
      + branch        = "release-1.5"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "tyk-identity-broker"
      + sha           = (known after apply)
      + source_branch = "master"
      + source_sha    = (known after apply)
    }

  # module.tyk-identity-broker.github_branch_protection.automerge["master"] will be created
  + resource "github_branch_protection" "automerge" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "master"
      + repository_id                   = "MDEwOlJlcG9zaXRvcnk0NzgzNjAwMg=="
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "1.21-bullseye",
              + "file",
              + "mongo-mgo",
              + "mongo-official",
            ]
          + strict   = true
        }
    }

  # module.tyk-identity-broker.github_branch_protection.automerge["release-1.4"] will be updated in-place
  ~ resource "github_branch_protection" "automerge" {
        id                              = "BPR_kwDOAtnrYs4CHTEd"
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + contexts = [
              + "1.19-bullseye",
              + "file",
              + "mongo-mgo",
              + "mongo-official",
            ]
          + strict   = true
        }
    }

  # module.tyk-identity-broker.github_branch_protection.automerge["release-1.5"] will be created
  + resource "github_branch_protection" "automerge" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "release-1.5"
      + repository_id                   = "MDEwOlJlcG9zaXRvcnk0NzgzNjAwMg=="
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + contexts = [
              + "1.19-bullseye",
              + "file",
              + "mongo-mgo",
              + "mongo-official",
            ]
          + strict   = true
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @sredxny, Action: `pull_request`*